ifoam/trunk/IFoam/examples/case_icoFoam/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_F
    {
        type            calculated;
        value           nonuniform List<scalar> 
606
(
-1.06973e-06
-1.18236e-06
-1.13521e-06
-1.2487e-06
-1.20955e-06
-1.21525e-06
-1.26718e-06
-1.29307e-06
...
)
;
    }
    outlet_F1
    {
        type            calculated;
        value           uniform 0;
    }
    outlet_F2
    {
        type            calculated;
        value           uniform 0;
    }
    pipe
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
